In [2]:
import pandas as pd

In [3]:
data = {
    'a':[1,2,3,4],
    'b':[4,5,6,7],
    'c':[7,8,5,2],
    'd':['Pratyush','BOB','Dean','Rhea']
}
df = pd.DataFrame(data)
df

   a  b  c         d
0  1  4  7  Pratyush
1  2  5  8       BOB
2  3  6  5      Dean
3  4  7  2      Rhea

In [4]:
df.set_index('a')

   b  c         d
a
1  4  7  Pratyush
2  5  8       BOB
3  6  5      Dean
4  7  2      Rhea

In [5]:
df.set_index("d",inplace= True)
df

          a  b  c
d
Pratyush  1  4  7
BOB       2  5  8
Dean      3  6  5
Rhea      4  7  2

In [6]:
df = df.reset_index()
df

          d  a  b  c
0  Pratyush  1  4  7
1       BOB  2  5  8
2      Dean  3  6  5
3      Rhea  4  7  2

In [7]:
data = {
    'a':[1,2,3,4],
    'b':[4,5,6,7],
    'c':[7,8,5,2],
    'd':['Pratyush','BOB','Dean','Rhea']
}
df1 = pd.DataFrame(data,index=['a','b','c','d'])
df1

   a  b  c         d
a  1  4  7  Pratyush
b  2  5  8       BOB
c  3  6  5      Dean
d  4  7  2      Rhea

In [8]:
df1 = df1.reindex(['b','c','d','a'])
df1

   a  b  c         d
b  2  5  8       BOB
c  3  6  5      Dean
d  4  7  2      Rhea
a  1  4  7  Pratyush

In [9]:
for i in df1.iterrows():
    print(i)

('b', a      2
b      5
c      8
d    BOB
Name: b, dtype: object)
('c', a       3
b       6
c       5
d    Dean
Name: c, dtype: object)
('d', a       4
b       7
c       2
d    Rhea
Name: d, dtype: object)
('a', a           1
b           4
c           7
d    Pratyush
Name: a, dtype: object)

In [10]:
df1.reset_index()

  index  a  b  c         d
0     b  2  5  8       BOB
1     c  3  6  5      Dean
2     d  4  7  2      Rhea
3     a  1  4  7  Pratyush

In [11]:
for i in df1.iterrows():
    print(i)

('b', a      2
b      5
c      8
d    BOB
Name: b, dtype: object)
('c', a       3
b       6
c       5
d    Dean
Name: c, dtype: object)
('d', a       4
b       7
c       2
d    Rhea
Name: d, dtype: object)
('a', a           1
b           4
c           7
d    Pratyush
Name: a, dtype: object)

In [12]:
list(df['d'])

['Pratyush', 'BOB', 'Dean', 'Rhea']

In [13]:
def text(x):
    return x.sum()
df1.apply(text)

a                     10
b                     22
c                     22
d    BOBDeanRheaPratyush
dtype: object

In [14]:
pd.set_option('display.max_colwidth',1000)
df3 = pd.DataFrame({'Desc':["The tiger is a member of the genus Panthera and the largest living cat Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.",'Hello World'],'key':['Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.','Hii']})
df3

,Desc,key
0,"The tiger is a member of the genus Panthera and the largest living cat Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.","Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi."
1,Hello World,Hii

In [15]:
df3['len'] = df3['Desc'].apply(len)
pd.DataFrame(df3)

,Desc,key,len
0,"The tiger is a member of the genus Panthera and the largest living cat Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.","Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.",525
1,Hello World,Hii,11

In [16]:
t = 'This is a Data Science Class'
len(t.split())

6

In [17]:
df3["word_count"] = df3['Desc'].apply(lambda x:(x.split()))
pd.DataFrame(df3)

,Desc,key,len,word_count
0,"The tiger is a member of the genus Panthera and the largest living cat Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.","Lorem ipsum dolor sit amet consectetur, adipisicing elit. Tempore tenetur vitae sunt, id doloremque deserunt repellendus beatae dicta voluptas eum assumenda sit! Magni voluptatibus in minima distinctio hic autem fugiat, quibusdam, necessitatibus iusto accusamus molestiae temporibus porro nesciunt labore ullam odit repellat debitis, quia sapiente atque animi provident vitae delectus. Quod ex enim, reiciendis architecto dolor earum dolorem autem animi.",525,"[The, tiger, is, a, member, of, the, genus, Panthera, and, the, largest, living, cat, Lorem, ipsum, dolor, sit, amet, consectetur,, adipisicing, elit., Tempore, tenetur, vitae, sunt,, id, doloremque, deserunt, repellendus, beatae, dicta, voluptas, eum, assumenda, sit!, Magni, voluptatibus, in, minima, distinctio, hic, autem, fugiat,, quibusdam,, necessitatibus, iusto, accusamus, molestiae, temporibus, porro, nesciunt, labore, ullam, odit, repellat, debitis,, quia, sapiente, atque, animi, provident, vitae, delectus., Quod, ex, enim,, reiciendis, architecto, dolor, earum, dolorem, autem, animi.]"
1,Hello World,Hii,11,"[Hello, World]"

In [18]:
pd.DataFrame(df1)

   a  b  c         d
b  2  5  8       BOB
c  3  6  5      Dean
d  4  7  2      Rhea
a  1  4  7  Pratyush

In [19]:
df1['a'].sum()

10

In [20]:
df1['a'].mean()

2.5

In [21]:
df1['a'].median()

2.5

In [22]:
df['a'].var()

1.6666666666666667

In [23]:
df['a'].std()

1.2909944487358056

In [24]:
df4 = pd.DataFrame({
    'a':[1,2,3,4,5,6,7,8,9],
})
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [25]:
df4['a'].rolling(window=3).sum()

0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
5    15.0
6    18.0
7    21.0
8    24.0
Name: a, dtype: float64

In [26]:
df4['a'].rolling(window=2).median()

0    NaN
1    1.5
2    2.5
3    3.5
4    4.5
5    5.5
6    6.5
7    7.5
8    8.5
Name: a, dtype: float64

In [57]:
date = pd.date_range(start='2023-08-15',end='2024-08-15')
pd.DataFrame(date)

             0
0   2023-08-15
1   2023-08-16
2   2023-08-17
3   2023-08-18
4   2023-08-19
..         ...
362 2024-08-11
363 2024-08-12
364 2024-08-13
365 2024-08-14
366 2024-08-15

[367 rows x 1 columns]